experimentos/EXP-002-k6-api-activities/logs/revalidacion-semana6.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: .\experimentos\EXP-002-k6-api-activities\scripts\baseline-activities.js
        output: json (.\experimentos\EXP-002-k6-api-activities\resultados\revalidacion-semana6.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 25 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  00m00.1s/10m0s  13/25 shared iters


  Ôûê TOTAL RESULTS

    checks_total.......: 52      40.639961/s
    checks_succeeded...: 100.00% 52 out of 52
    checks_failed......: 0.00%   0 out of 52

    Ô£ô login devuelve 200
    Ô£ô categories devuelve 200
    Ô£ô actividad devuelve 201
    Ô£ô actividad devuelve id

    CUSTOM
    activity_create_duration.......: avg=8.49ms  min=6.8ms med=7.51ms max=23.33ms  p(90)=9.99ms  p(95)=12.08ms
    activity_create_success........: 100.00% 25 out of 25

    HTTP
    http_req_duration..............: avg=23.85ms min=5.2ms med=7.09ms max=853.71ms p(90)=10.63ms p(95)=17.41ms
      { expected_response:true }...: avg=23.85ms min=5.2ms med=7.09ms max=853.71ms p(90)=10.63ms p(95)=17.41ms
    http_req_failed................: 0.00%   0 out of 53
    http_reqs......................: 53      41.421498/s

    EXECUTION
    iteration_duration.............: avg=8.68ms  min=6.8ms med=7.75ms max=23.33ms  p(90)=10.2ms  p(95)=12.08ms
    iterations.....................: 25      19.538443/s
    vus............................: 1       min=1        max=1
    vus_max........................: 1       min=1        max=1

    NETWORK
    data_received..................: 32 kB   25 kB/s
    data_sent......................: 27 kB   21 kB/s



running (00m01.3s), 0/1 VUs, 25 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 1 VUs  00m00.2s/10m0s  25/25 shared iters